Revit 2027 API
FabricSheetType.IsValidMajorLapSplice Method
 Identifies if the input value is valid to be applied as the major lap splice value for this FabricSheetType.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidMajorLapSplice(
	double majorLapSplice
)
Public Function IsValidMajorLapSplice (
	majorLapSplice As Double
) As Boolean
public:
bool IsValidMajorLapSplice(
	double majorLapSplice
)
member IsValidMajorLapSplice :
        majorLapSplice : float -> bool
Parameters
majorLapSplice Double
Return Value
Boolean
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace